## Understanding Pandas DataFrame

Welcome to the notebook titled "Understanding Pandas DataFrame"! The robust data manipulation and analysis features of Pandas, a popular Python package for data manipulation and analysis, will be explored in this notebook.

For processing structured data, such as tabular data, CSV files, SQL tables, and more, Pandas offers the DataFrame, a highly effective and simple-to-use data structure. The DataFrame is an excellent option for data exploration, cleaning, transformation, and analysis because it is a two-dimensional labeled data structure with columns of potentially varied types.
Creating and Accessing DataFrames: Discover how to generate DataFrames from various data sources, including CSV files, Excel spreadsheets, and Python dictionaries. We will also investigate various methods for accessing and obtaining data from DataFrames.
1. Data Manipulation: Learn different methods for transforming and manipulating DataFrame data. Filtering rows, choosing columns, adding or removing columns, handling missing values, and grouping data for aggregation are a few of the procedures we'll examine.
2. Data Cleaning: Acquire knowledge about DataFrames' cleaning and preprocessing procedures. We will examine methods for dealing with missing numbers, eliminating duplicates, managing outliers, and converting data types.
3. Data Analysis: Explore DataFrames' analytical capabilities. Descriptive statistics, data visualization, handling of dates and timings, and complex data transformations will all be covered.
4. Data Integration: Learn how to mix and integrate data from many sources by merging, joining, and concatenating DataFrames. We'll look at methods for combining data based on shared keys or indices.


By the end of this notebook, you will be well equipped to carry out a variety of data manipulation, cleaning, and analysis activities effectively and have a firm grasp of the fundamental ideas of Pandas DataFrame.
Let's begin and utilize Pandas DataFrame to its total capacity for your data analysis endeavors!

In [1]:
# Import the needed library
import pandas as pd

In [2]:
# Create an empty DataFrame
df = pd.DataFrame()

In [5]:
# View the first 5 rows of the DataFrame
df.head()

Empty DataFrame
Columns: []
Index: []

In [6]:
# View the last 5 rows of the DataFrame
df.tail()

Empty DataFrame
Columns: []
Index: []

## Creating a DataFrame using a Dictionary

In [10]:
# Creating dictionary of list
data = {'FirstName':['Guy','Kevin','Roberto','Rob','Thierry','David','JoLynn','Ruth','Gail','Barry'], 'Department':['Production','Marketing','Engineering','Tool', 'Design',
'Production Control','Information Services','Human Resources','Information Services','Human Resources']}
a
# Convert the dictionary to a DataFrame
df = pd.DataFrame(data)

# View the DataFrame
df

  FirstName            Department
0       Guy            Production
1     Kevin             Marketing
2   Roberto           Engineering
3       Rob                  Tool
4   Thierry                Design
5     David    Production Control
6    JoLynn  Information Services
7      Ruth       Human Resources
8      Gail  Information Services
9     Barry       Human Resources

## Creating a DataFrame using a List of Tuple

In [12]:
# Create a list of Tuble
data2 = [('Gilbert','1/28/2006'),('Brown','8/26/2006'),('Tamburello','6/11/2007')]

# View the data
data2

[('Gilbert', '1/28/2006'), ('Brown', '8/26/2006'), ('Tamburello', '6/11/2007')]

In [13]:
# Convert the data to a DataFrame
df = pd.DataFrame(data2, columns=['Name', 'Hired Date'])

# View the DataFrame
df.head()

         Name Hired Date
0     Gilbert  1/28/2006
1       Brown  8/26/2006
2  Tamburello  6/11/2007

## Importing data from Excel source

In [22]:
# Import data from an excel file
filePath = 'data/people.xlsx'
excel_df = pd.read_excel(filePath)
# Get the first 5 rows of the DataFrame
excel_df.head()

   BusinessEntityID  FirstName MiddleName     LastName
0               285       Syed          E        Abbas
1               293  Catherine         R.         Abel
2                38        Kim          B  Abercrombie
3               211      Hazem          E     Abolrous
4               121      Pilar          G     Ackerman

In [23]:
# Get the last 5 rows of the DataFrame
excel_df.tail()

    BusinessEntityID FirstName MiddleName   LastName
16              5055   Eduardo          A   Albright
17             16858    Elijah          L     Albury
18              3889  Fernando          S     Alcorn
19               301   Frances         B.   Alderson
20             16850   Gabriel          S  Alexander

In [17]:
# Select individual columns
bus_series = excel_df['BusinessEntityID']

# Display the data
bus_series

# Check the type
type(bus_series)

pandas.core.series.Series

In [18]:
# Check the shape of the DataFrame
excel_df.shape

(21, 4)

In [19]:
# Get the list of columns
excel_df.columns

Index(['BusinessEntityID', 'FirstName', 'MiddleName', 'LastName'], dtype='object')

In [20]:
# Check the type of the DataFrame
excel_df.dtypes

BusinessEntityID     int64
FirstName           object
MiddleName          object
LastName            object
dtype: object

## Importing Data from SQL Server

In [38]:
# pip install pyodbc or pip install pyodbc==4.0.31

In [39]:
import pyodbc

In [47]:
# Creating the connection to SQL
conn = pyodbc.connect('DRIVER={ODBC Driver 17 for SQL Server};SERVER=JONATHAN-POLLYN\SQLEXPRESS01;DATABASE=AdventureWorks2016;Trusted_Connection=yes;')
cursor=conn.cursor()

# Executing the query
query = "SELECT BusinessEntityID,JobTitle,BirthDate,Gender,HireDate FROM HumanResources.Employee"
sql_df = pd.read_sql(query,conn)

sql_df.head()

C:\anacondamain\lib\site-packages\pandas\io\sql.py:762: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

,BusinessEntityID,JobTitle,BirthDate,Gender,HireDate
0,1,Chief Executive Officer,1969-01-29,M,2009-01-14
1,2,Vice President of Engineering,1971-08-01,F,2008-01-31
2,3,Engineering Manager,1974-11-12,M,2007-11-11
3,4,Senior Tool Designer,1974-12-23,M,2007-12-05
4,5,Design Engineer,1952-09-27,F,2008-01-06

## Finding and filtering data in DataFrame

In [48]:
# Extract the data from index number 2
sql_df.loc[2]

BusinessEntityID                      3
JobTitle            Engineering Manager
BirthDate                    1974-11-12
Gender                                M
HireDate                     2007-11-11
Name: 2, dtype: object

In [50]:
# Extract the data from index number 4
sql_df.loc[4]

BusinessEntityID                  5
JobTitle            Design Engineer
BirthDate                1952-09-27
Gender                            F
HireDate                 2008-01-06
Name: 4, dtype: object

In [51]:
# Extract the rows from index number 1 to 4
sql_df.loc[1:4]

,BusinessEntityID,JobTitle,BirthDate,Gender,HireDate
1,2,Vice President of Engineering,1971-08-01,F,2008-01-31
2,3,Engineering Manager,1974-11-12,M,2007-11-11
3,4,Senior Tool Designer,1974-12-23,M,2007-12-05
4,5,Design Engineer,1952-09-27,F,2008-01-06

In [53]:
# Extract the first 2 rows of the data
sql_df.iloc[0:2]

,BusinessEntityID,JobTitle,BirthDate,Gender,HireDate
0,1,Chief Executive Officer,1969-01-29,M,2009-01-14
1,2,Vice President of Engineering,1971-08-01,F,2008-01-31

In [55]:
# Return records where the job title is Design Engineer
sql_df.loc[sql_df['JobTitle'] == 'Design Engineer']

    BusinessEntityID         JobTitle   BirthDate Gender    HireDate
4                  5  Design Engineer  1952-09-27      F  2008-01-06
5                  6  Design Engineer  1959-03-11      M  2008-01-24
14                15  Design Engineer  1961-05-02      F  2011-01-18

In [56]:
# OR
sql_df[sql_df['JobTitle']=='Design Engineer']

    BusinessEntityID         JobTitle   BirthDate Gender    HireDate
4                  5  Design Engineer  1952-09-27      F  2008-01-06
5                  6  Design Engineer  1959-03-11      M  2008-01-24
14                15  Design Engineer  1961-05-02      F  2011-01-18